{
    "challenges": [{
            "type": "open-question",
            "question": "How do you test the emoticons are displayed across different platforms correctly?",
            "example_apps": [
                "Skype",
                "Slack",
                "MS Teams"
            ]
        },
        {
            "type": "open-question",
            "question": "How do I test recording?",
            "example_apps": [
                "GoogleHangouts",
                "MS Teams"
            ]
        },
        {
            "type": "open-question",
            "question": "How do you test 'block user' functionality in a chat app?",
            "example_apps": [
                "Skype",
                "Slack"
            ]
        },
        {
            "type": "open-question",
            "question": "Does the recording pick up the background noise from one of the participant?",
            "example_apps": [
                "GoogleHangouts",
                "MS Team"
            ]
        },
        {
            "type": "open-question",
            "question": "How do you test a video call application temporarily disables video for someone who has high latency?",
            "example_apps": [
                "GoogleHangouts",
                "MS Team"
            ]
        },
        {
            "type": "open-question",
            "question": "How does a word processing application hande mulitple people editing the same line at the same time?",
            "example_apps": [
                "Google Docs",
                "MS Office"
            ]
        },
        {
            "type": "open-question",
            "question": "How does a CI/CD tool handle a queue of events that trigger a test?",
            "example_apps": [
                "Jenkins",
                "Circle CI"
            ]
        },
        {
            "type": "open-question",
            "question": "How do you check the plugin's compatibility for a platform that changes frequently?",
            "example_apps": [
                "Chrome",
                "Firefox",
                "Jenkins"
            ]
        },
        {
            "type": "open-question",
            "question": "How do you test if the search returns the right results on chat platforms?",
            "example_apps": [
                "Skype",
                "Slack",
                "MS Teams"
            ]
        },
        {
            "type": "open-question",
            "question": "How does the video chat application knows there is latency in a connection?",
            "example_apps": [
                "Skype",
                "Slack",
                "MS Teams"
            ]
        },
        {
            "type": "open-question",
            "question": "How are the messages ordered in a group chat? messages first sent to the application server are listed first? messages received at the server are listed first?",
            "example_apps": [
                "Skype",
                "Slack",
                "MS Teams"
            ]
        },
        {
            "type": "open-question",
            "question": "I liked the utility future bug predictor and usage of machine learning in predicting bugs. How do you test the feature of predicting the bugs such as there will be 5 bugs in next release?",
            "example_apps": [
                "Atlassian"
            ]
        },
        {
            "type": "open-question",
            "question": "@linkedin, I like the feature views of your post, to know how many views you have received, I was wondering how do you test the integration of this feature with external sources such blogs, tweeter etc..?",
            "example_apps": [
                "Linkedin"
            ]
        },
        {
            "type": "open-question",
            "question": "How do you test calendar events sent to people across different time zones?",
            "example_apps": [
                "Google",
                "Outlook"
            ]
        },
        {
            "type": "open-question",
            "question": "IDEs support multiple languages. How do you test for each one of them?",
            "example_apps": [
                "VS Code",
                "Notepad",
                "SublimeText"
            ]
        },
        {
            "type": "open-question",
            "question": "Social media apps provide many face filters and lenses. How do we go about testing these?",
            "example_apps": [
                "Snapchat",
                "Instagram",
                "Facebook"
            ]
        },
        {
            "type": "open-question",
            "question": "How does one test the smart draw features like eraser and the limit of branching in mindmaps feature, in remote whiteboards?",
            "example_apps": [
                "Miro"
            ]
        },
        {
            "type": "open-question",
            "question": "I regularly use #GoogleMeet.Recently I have used the Turn-on Captions feature How to see its ability to capture some of the things as words even though we spell out letters e.g my company name QxF2. As a tester, I am wondering how do we test this feature with complex and variety of inputs ?",
            "example_apps": [
                "GoogleMeet"
            ]
        },
        {
            "type": "open-question",
            "question": "When you create overview videos, how do you know to pick the relevant photos (For example, it ignores document images, blurred images etc.)",
            "example_apps": [
                "Google Photos"
            ]
        },
        {
            "type": "open-question",
            "question": "#Whatsapp, I wonder how do you test data sync between web and mobile app for the same account and to what accuracy can it be synced ?",
            "example_apps": [
                "Whatsapp",
                "Facebook"
            ]
        },
        {
            "type": "open-question",
            "question": "How do you test a feature in which the way VR controller handles the sensors and differentiates movement, speed.",
            "example_apps": [
                "Oculus Rift"
            ]
        },
        {
            "type": "open-question",
            "question": "How do you test that the suggested videos are relevant. Can it be done in an automated way?",
            "example_apps": [
                "YouTube"
            ]
        },
        {
            "type": "open-question",
            "question": "How do you test the words when pronunciation is different for other regions?",
            "example_apps": [
                "Google",
                "Google voice search"
            ]
        }
    ]
}